import './App.css';
import Mark from './mark'


function App() {
  return (
    <div className="App">
      <Mark>
        <div>
          <h4>文章示例</h4>
          <p>  过年我最高兴，不用担心迟到，不用做作业，每天睡到自然醒，就算偶尔调皮，大人也都会一笑了之，不会责备。
            <span>z这是测试啊<span>这是层级三 <span>这是层级4</span></span></span>
          </p>
          <p>　爸爸把街上买来十二个红彤彤的灯笼，串成了两串，挂在门楼两旁，爸爸笑着说：“十二个红灯笼预示我们全家，在新的一年里，十二个月都红红火火，你也不用担心小鬼的侵扰。”我和爸爸一起贴春联和福字。妈妈忙着准备丰盛的年夜饭，有海鲜、蔬菜、牛肉，当然少不了意味着“年年有余”的鱼，吃年夜饭之前要先行祭祖。我还要到超市里买橙汁、啤酒，准备吃年夜饭用。
</p>
          <p>正月初一，是我又一个开心的曰子。吃过汤圆，去走亲访友拜新年，既拿了红包又玩了一上午。下午，我袋里装着父母给的零花钱，与表哥姐及堂弟妹一起到街上玩，甭提多高兴了。路上的小鸟大概它们心里也很高兴吧，也来凑热闹。今天算是一饱眼福二饱口福三饱手福了！</p>
          <p>
            大年初二中午，天气很好，爸爸带我到乡村的田野里转了一圈。站在田埂上放眼望去，正在拔节的麦苗儿，显出袅娜窈窕的姿态，妩媚地谈笑；小沟里的水细微的涟漪；野草和小花点缀着美的世界。
</p>
          <p>　我仔细观察了一颗绿油油的麦苗，两片大的叶子中间还有一个嫩芽，爸爸告诉我：“这就是麦芽，长大会开花，结成我们要吃的麦子。”</p>

          <p>墙角下蜷缩了一个冬季的蔷薇花，早就乘着春风爬上了墙头，用它那最娇嫩的新芽迎接着春天的祝福。现在我知道了生机勃勃，芝麻开花节节高的生活。</p>

          <p>　　春节的喜庆欢乐令我难忘！</p>
        </div>
      </Mark>
    </div>
  );
}

export default App;
